#coding: utf-8

#Задание 10
a = []
i = 0 
while i < 600: 
    if i % 28 == 0:
       a[i] = i
        i += 28 
        print(i)
        
#Задание 11
b = 10
d = 1
while b <= 20:
    b += b * 0.1
    d += 1 
print("Лыжник пробежит 20 км на день", d)

#Задание 12


#Задание 13


#Задание 14
a = 14
while n * 11 < 100:
    n * 11
    print(n)
    n += 1